betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_utils.c
#if defined(FLASH_LATENCY1_FREQ)
#define UTILS_LATENCY1_FREQ         FLASH_LATENCY1_FREQ       /*!< HCLK frequency to set FLASH latency 1 */
#endif /* FLASH_LATENCY1_FREQ */
#if defined(FLASH_LATENCY2_FREQ)
#define UTILS_LATENCY2_FREQ         FLASH_LATENCY2_FREQ       /*!< HCLK frequency to set FLASH latency 2 */
#endif /* FLASH_LATENCY2_FREQ */
#if defined(FLASH_LATENCY3_FREQ)
#define UTILS_LATENCY3_FREQ         FLASH_LATENCY3_FREQ       /*!< HCLK frequency to set FLASH latency 3 */
#endif /* FLASH_LATENCY3_FREQ */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup UTILS_DDL_Private_Macros
  * @{
  */
#define IS_DDL_UTILS_SYSCLK_DIV(__VALUE__) (((__VALUE__) == DDL_RCM_SYSCLK_DIV_1)   \
                                        || ((__VALUE__) == DDL_RCM_SYSCLK_DIV_2)   \
                                        || ((__VALUE__) == DDL_RCM_SYSCLK_DIV_4)   \
                                        || ((__VALUE__) == DDL_RCM_SYSCLK_DIV_8)   \
                                        || ((__VALUE__) == DDL_RCM_SYSCLK_DIV_16)  \
                                        || ((__VALUE__) == DDL_RCM_SYSCLK_DIV_64)  \
                                        || ((__VALUE__) == DDL_RCM_SYSCLK_DIV_128) \
                                        || ((__VALUE__) == DDL_RCM_SYSCLK_DIV_256) \
                                        || ((__VALUE__) == DDL_RCM_SYSCLK_DIV_512))

#define IS_DDL_UTILS_APB1_DIV(__VALUE__) (((__VALUE__) == DDL_RCM_APB1_DIV_1) \
                                      || ((__VALUE__) == DDL_RCM_APB1_DIV_2) \
                                      || ((__VALUE__) == DDL_RCM_APB1_DIV_4) \
                                      || ((__VALUE__) == DDL_RCM_APB1_DIV_8) \
                                      || ((__VALUE__) == DDL_RCM_APB1_DIV_16))

#define IS_DDL_UTILS_APB2_DIV(__VALUE__) (((__VALUE__) == DDL_RCM_APB2_DIV_1) \
                                      || ((__VALUE__) == DDL_RCM_APB2_DIV_2) \
                                      || ((__VALUE__) == DDL_RCM_APB2_DIV_4) \
                                      || ((__VALUE__) == DDL_RCM_APB2_DIV_8) \
                                      || ((__VALUE__) == DDL_RCM_APB2_DIV_16))

#if defined(APM32F403xx) || defined(APM32F402xx)
#define IS_DDL_UTILS_PLLMUL_VALUE(__VALUE__) (((__VALUE__) == DDL_RCM_PLL_MUL_2) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_3) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_4) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_5) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_6) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_7) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_8) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_9) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_10) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_11) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_12) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_13) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_14) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_15) \
                                          || ((__VALUE__) == DDL_RCM_PLL_MUL_16))

#define IS_DDL_UTILS_PREDIV_VALUE(__VALUE__) (((__VALUE__) == DDL_RCM_PREDIV_DIV_1)  || ((__VALUE__) == DDL_RCM_PREDIV_DIV_2))
#else
#define IS_DDL_UTILS_PLLB_VALUE(__VALUE__) (((__VALUE__) == DDL_RCM_PLLB_DIV_2)  \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_3)  \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_4)  \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_5)  \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_6)  \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_7)  \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_8)  \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_9)  \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_10) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_11) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_12) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_13) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_14) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_15) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_16) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_17) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_18) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_19) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_20) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_21) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_22) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_23) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_24) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_25) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_26) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_27) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_28) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_29) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_30) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_31) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_32) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_33) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_34) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_35) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_36) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_37) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_38) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_39) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_40) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_41) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_42) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_43) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_44) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_45) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_46) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_47) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_48) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_49) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_50) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_51) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_52) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_53) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_54) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_55) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_56) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_57) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_58) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_59) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_60) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_61) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_62) \
                                        || ((__VALUE__) == DDL_RCM_PLLB_DIV_63))

#define IS_DDL_UTILS_PLL1A_VALUE(__VALUE__) ((RCM_PLL1A_MIN_VALUE <= (__VALUE__)) && ((__VALUE__) <= RCM_PLL1A_MAX_VALUE))

