betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_utils.c
#define IS_DDL_UTILS_PLL1C_VALUE(__VALUE__) (((__VALUE__) == DDL_RCM_PLL1C_DIV_2) \
                                        || ((__VALUE__) == DDL_RCM_PLL1C_DIV_4) \
                                        || ((__VALUE__) == DDL_RCM_PLL1C_DIV_6) \
                                        || ((__VALUE__) == DDL_RCM_PLL1C_DIV_8))
#endif /* APM32F403xx || APM32F402xx */

#define IS_DDL_UTILS_PLLVCO_INPUT(__VALUE__)  ((UTILS_PLLVCO_INPUT_MIN <= (__VALUE__)) && ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX))

#define IS_DDL_UTILS_PLLVCO_OUTPUT(__VALUE__) ((UTILS_PLLVCO_OUTPUT_MIN <= (__VALUE__)) && ((__VALUE__) <= UTILS_PLLVCO_OUTPUT_MAX))

#if defined(APM32F403xx) || defined(APM32F402xx)
#define IS_DDL_UTILS_PLL_FREQUENCY(__VALUE__) ((__VALUE__) <= UTILS_PLLVCO_OUTPUT_MAX)
#else
#if !defined(RCM_MAX_FREQUENCY_SCALE1)
#define IS_DDL_UTILS_PLL_FREQUENCY(__VALUE__) ((DDL_PMU_GetRegulVoltageScaling() == DDL_PMU_REGU_VOLTAGE_SCALE2) ? ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE2) : \
                                             ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE3))
                                             
#elif defined(RCM_MAX_FREQUENCY_SCALE3) 
#define IS_DDL_UTILS_PLL_FREQUENCY(__VALUE__) ((DDL_PMU_GetRegulVoltageScaling() == DDL_PMU_REGU_VOLTAGE_SCALE1) ? ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE1) : \
                                              (DDL_PMU_GetRegulVoltageScaling() == DDL_PMU_REGU_VOLTAGE_SCALE2) ? ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE2) : \
                                              ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE3))

#else
#define IS_DDL_UTILS_PLL_FREQUENCY(__VALUE__) ((DDL_PMU_GetRegulVoltageScaling() == DDL_PMU_REGU_VOLTAGE_SCALE1) ? ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE1) : \
                                             ((__VALUE__) <= UTILS_MAX_FREQUENCY_SCALE2))

#endif /* RCM_MAX_FREQUENCY_SCALE1*/
#endif /* APM32F403xx || APM32F402xx */
#define IS_DDL_UTILS_HSE_BYPASS(__STATE__) (((__STATE__) == DDL_UTILS_HSEBYPASS_ON) \
                                        || ((__STATE__) == DDL_UTILS_HSEBYPASS_OFF))

#define IS_DDL_UTILS_HSE_FREQUENCY(__FREQUENCY__) (((__FREQUENCY__) >= UTILS_HSE_FREQUENCY_MIN) && ((__FREQUENCY__) <= UTILS_HSE_FREQUENCY_MAX))
/**
  * @}
  */
/* Private function prototypes -----------------------------------------------*/
/** @defgroup UTILS_DDL_Private_Functions UTILS Private functions
  * @{
  */
static uint32_t    UTILS_GetPLLOutputFrequency(uint32_t PLL_InputFrequency,
                                               DDL_UTILS_PLLInitTypeDef *UTILS_PLLInitStruct);
static ErrorStatus UTILS_EnablePLLAndSwitchSystem(uint32_t SYSCLK_Frequency, DDL_UTILS_ClkInitTypeDef *UTILS_ClkInitStruct);
static ErrorStatus UTILS_PLL_IsBusy(void);
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup UTILS_DDL_Exported_Functions
  * @{
  */

/** @addtogroup UTILS_DDL_EF_DELAY
  * @{
  */

/**
  * @brief  This function configures the Cortex-M SysTick source to have 1ms time base.
  * @note   When a RTOS is used, it is recommended to avoid changing the Systick
  *         configuration by calling this function, for a delay use rather osDelay RTOS service.
  * @param  HCLKFrequency HCLK frequency in Hz
  * @note   HCLK frequency can be calculated thanks to RCM helper macro or function @ref DDL_RCM_GetSystemClocksFreq
  * @retval None
  */
void DDL_Init1msTick(uint32_t HCLKFrequency)
{
  /* Use frequency provided in argument */
  DDL_InitTick(HCLKFrequency, 1000U);
}

/**
  * @brief  This function provides accurate delay (in milliseconds) based
  *         on SysTick counter flag
  * @note   When a RTOS is used, it is recommended to avoid using blocking delay
  *         and use rather osDelay service.
  * @note   To respect 1ms timebase, user should call @ref DDL_Init1msTick function which
  *         will configure Systick to 1ms
  * @param  Delay specifies the delay time length, in milliseconds.
  * @retval None
  */
void DDL_mDelay(uint32_t Delay)
{
  __IO uint32_t  tmp = SysTick->CTRL;  /* Clear the COUNTFLAG first */
  /* Add this code to indicate that local variable is not used */
  ((void)tmp);

  /* Add a period to guaranty minimum wait */
  if(Delay < DDL_MAX_DELAY)
  {
    Delay++;
  }

  while (Delay)
  {
    if((SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) != 0U)
    {
      Delay--;
    }
  }
}

/**
  * @}
  */

/** @addtogroup UTILS_EF_SYSTEM
  *  @brief    System Configuration functions
  *
  @verbatim
 ===============================================================================
           ##### System Configuration functions #####
 ===============================================================================
    [..]
         System, AHB and APB buses clocks configuration

         (+) The maximum frequency of the SYSCLK, HCLK, PCLK1 and PCLK2 is 180000000 Hz.
  @endverbatim
  @internal
             Depending on the device voltage range, the maximum frequency should be
             adapted accordingly to the Refenece manual.
  @endinternal
  * @{
  */

/**
  * @brief  This function sets directly SystemCoreClock CMSIS variable.
  * @note   Variable can be calculated also through SystemCoreClockUpdate function.
  * @param  HCLKFrequency HCLK frequency in Hz (can be calculated thanks to RCM helper macro)
  * @retval None
  */
void DDL_SetSystemCoreClock(uint32_t HCLKFrequency)
{
  /* HCLK clock frequency */
  SystemCoreClock = HCLKFrequency;
}

/**
  * @brief  Update number of Flash wait states in line with new frequency and current
            voltage range.
  * @note   This Function support ONLY devices with supply voltage (voltage range) between 2.7V and 3.6V
  * @param  HCLK_Frequency  HCLK frequency
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: Latency has been modified
  *          - ERROR: Latency cannot be modified
  */
ErrorStatus DDL_SetFlashLatency(uint32_t HCLK_Frequency)
{
  uint32_t timeout;
  uint32_t getlatency;
  uint32_t latency = DDL_FLASH_LATENCY_0;  /* default value 0WS */
  ErrorStatus status = SUCCESS;


  /* Frequency cannot be equal to 0 */
  if(HCLK_Frequency == 0U)
  {
    status = ERROR;
  }
  else
  {
#if defined(PMU_CTRL_VOSSEL)
    if(DDL_PMU_GetRegulVoltageScaling() == DDL_PMU_REGU_VOLTAGE_SCALE1)
    {
#if defined (UTILS_SCALE1_LATENCY7_FREQ)
      if((HCLK_Frequency > UTILS_SCALE1_LATENCY7_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_7;
      }
#endif /*UTILS_SCALE1_LATENCY7_FREQ */
#if defined (UTILS_SCALE1_LATENCY6_FREQ)
      if((HCLK_Frequency > UTILS_SCALE1_LATENCY6_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_6;
      }
#endif /*UTILS_SCALE1_LATENCY6_FREQ */
#if defined (UTILS_SCALE1_LATENCY5_FREQ)
      if((HCLK_Frequency > UTILS_SCALE1_LATENCY5_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_5;
      }
#endif /*UTILS_SCALE1_LATENCY5_FREQ */
#if defined (UTILS_SCALE1_LATENCY4_FREQ)
      if((HCLK_Frequency > UTILS_SCALE1_LATENCY4_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_4;
      }
#endif /* UTILS_SCALE1_LATENCY4_FREQ */
#if defined (UTILS_SCALE1_LATENCY3_FREQ)
      if((HCLK_Frequency > UTILS_SCALE1_LATENCY3_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_3;
      }
#endif /* UTILS_SCALE1_LATENCY3_FREQ */
#if defined (UTILS_SCALE1_LATENCY2_FREQ) 
      if((HCLK_Frequency > UTILS_SCALE1_LATENCY2_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_2;
      }
      else
      {
        if((HCLK_Frequency > UTILS_SCALE1_LATENCY1_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
        {
          latency = DDL_FLASH_LATENCY_1;
        }
      }
#endif /* UTILS_SCALE1_LATENCY2_FREQ */
    }
    if(DDL_PMU_GetRegulVoltageScaling() == DDL_PMU_REGU_VOLTAGE_SCALE2)
    {
#if defined (UTILS_SCALE2_LATENCY5_FREQ)
      if((HCLK_Frequency > UTILS_SCALE2_LATENCY5_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_5;
      }
#endif /*UTILS_SCALE2_LATENCY5_FREQ */
#if defined (UTILS_SCALE2_LATENCY4_FREQ)
      if((HCLK_Frequency > UTILS_SCALE2_LATENCY4_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_4;
      }
#endif /*UTILS_SCALE2_LATENCY4_FREQ */
#if defined (UTILS_SCALE2_LATENCY3_FREQ)
      if((HCLK_Frequency > UTILS_SCALE2_LATENCY3_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_3;
      }
#endif /*UTILS_SCALE2_LATENCY3_FREQ */
      if((HCLK_Frequency > UTILS_SCALE2_LATENCY2_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_2;
      }
      else
      {
        if((HCLK_Frequency > UTILS_SCALE2_LATENCY1_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
        {
          latency = DDL_FLASH_LATENCY_1;
        }
      }
    }
#if defined (DDL_PMU_REGU_VOLTAGE_SCALE3)
    if(DDL_PMU_GetRegulVoltageScaling() == DDL_PMU_REGU_VOLTAGE_SCALE3)
    {
#if defined (UTILS_SCALE3_LATENCY3_FREQ)
      if((HCLK_Frequency > UTILS_SCALE3_LATENCY3_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_3;
      }
#endif /*UTILS_SCALE3_LATENCY3_FREQ */
#if defined (UTILS_SCALE3_LATENCY2_FREQ)
      if((HCLK_Frequency > UTILS_SCALE3_LATENCY2_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
      {
        latency = DDL_FLASH_LATENCY_2;
      }
      else
      {
        if((HCLK_Frequency > UTILS_SCALE3_LATENCY1_FREQ)&&(latency == DDL_FLASH_LATENCY_0))
        {
          latency = DDL_FLASH_LATENCY_1;
        }
      }
#endif /*UTILS_SCALE3_LATENCY2_FREQ */
    }
#endif /* DDL_PMU_REGU_VOLTAGE_SCALE3 */
#else
    if((HCLK_Frequency > UTILS_LATENCY3_FREQ))
    {
      /* 90 < HCLK <= 120 MHz => 3WS */
      latency = DDL_FLASH_LATENCY_3;
    }
    else
    {
      if((HCLK_Frequency > UTILS_LATENCY2_FREQ))
      {
        /* 60 < HCLK <= 90 MHz => 2WS */
        latency = DDL_FLASH_LATENCY_2;
      }
      else
      {
        if((HCLK_Frequency > UTILS_LATENCY1_FREQ))
        {
          /* 30 < HCLK <= 60 MHz => 1WS */
          latency = DDL_FLASH_LATENCY_1;
        }
        else
        {
          /* HCLK <= 30 MHz => 0WS */
          latency = DDL_FLASH_LATENCY_0;
        }
      }
    }
#endif /* PMU_CTRL_VOSSEL */

    DDL_FLASH_SetLatency(latency);
    /* Check that the new number of wait states is taken into account to access the Flash
       memory by reading the FLASH_ACCTRL register */
    timeout = 2;
    do
    {
    /* Wait for Flash latency to be updated */
    getlatency = DDL_FLASH_GetLatency();
    timeout--;
    } while ((getlatency != latency) && (timeout > 0));

    if(getlatency != latency)
    {
      status = ERROR;
    }
    else
    {
      status = SUCCESS;
    }
  }
  return status;
}

/**
  * @brief  This function configures system clock at maximum frequency with HSI as clock source of the PLL
  * @note   The application need to ensure that PLL is disabled.
  * @note   Function is based on the following formula:
  *         - PLL output frequency = (((HSI frequency / PLLB) * PLL1A) / PLL1C)
  *         - PLLB: ensure that the VCO input frequency ranges from @ref RCM_PLLVCO_INPUT_MIN to @ref RCM_PLLVCO_INPUT_MAX (PLLVCO_input = HSI frequency / PLLB)
  *         - PLL1A: ensure that the VCO output frequency is between @ref RCM_PLLVCO_OUTPUT_MIN and @ref RCM_PLLVCO_OUTPUT_MAX (PLLVCO_output = PLLVCO_input * PLL1A)
  *         - PLL1C: ensure that max frequency at 180000000 Hz is reach (PLLVCO_output / PLL1C)
  * @note   Function is based on the following formula(Only for APM32F402/403xx device):
  *         - PLL output frequency = ((HSI frequency / 2) * PLLMULCFG)
  *         - PLLMULCFG: The application software must set correctly the PLL multiplication factor to
  *                   not exceed 120MHz
  * @param  UTILS_PLLInitStruct pointer to a @ref DDL_UTILS_PLLInitTypeDef structure that contains
  *                             the configuration information for the PLL.
  * @param  UTILS_ClkInitStruct pointer to a @ref DDL_UTILS_ClkInitTypeDef structure that contains
  *                             the configuration information for the BUS prescalers.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: Max frequency configuration done
  *          - ERROR: Max frequency configuration not done
  */
ErrorStatus DDL_PLL_ConfigSystemClock_HSI(DDL_UTILS_PLLInitTypeDef *UTILS_PLLInitStruct,
                                         DDL_UTILS_ClkInitTypeDef *UTILS_ClkInitStruct)
{
  ErrorStatus status = SUCCESS;
  uint32_t pllfreq = 0U;

  /* Check if one of the PLL is enabled */
  if(UTILS_PLL_IsBusy() == SUCCESS)
  {
#if defined(APM32F403xx) || defined(APM32F402xx)
    UTILS_PLLInitStruct->Prediv = DDL_RCM_PREDIV_DIV_2;
#endif /* APM32F403xx || APM32F402xx */
    /* Calculate the new PLL output frequency */
    pllfreq = UTILS_GetPLLOutputFrequency(HSI_VALUE, UTILS_PLLInitStruct);

    /* Enable HSI if not enabled */
    if(DDL_RCM_HSI_IsReady() != 1U)
    {
      DDL_RCM_HSI_Enable();
      while (DDL_RCM_HSI_IsReady() != 1U)
      {
        /* Wait for HSI ready */
      }
    }

    /* Configure PLL */
#if defined(APM32F403xx) || defined(APM32F402xx)
    DDL_RCM_PLL_ConfigDomain_SYS(DDL_RCM_PLLSOURCE_HSI_DIV_2, UTILS_PLLInitStruct->PLLMul);
#else
    DDL_RCM_PLL_ConfigDomain_SYS(DDL_RCM_PLLSOURCE_HSI, UTILS_PLLInitStruct->PLLB, UTILS_PLLInitStruct->PLL1A,
                                UTILS_PLLInitStruct->PLL1C);
#endif /* APM32F403xx || APM32F402xx */

