betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_utils.c
    /* Enable PLL and switch system clock to PLL */
    status = UTILS_EnablePLLAndSwitchSystem(pllfreq, UTILS_ClkInitStruct);
  }
  else
  {
    /* Current PLL configuration cannot be modified */
    status = ERROR;
  }

  return status;
}

/**
  * @brief  This function configures system clock with HSE as clock source of the PLL
  * @note   The application need to ensure that PLL is disabled.
  * @note   Function is based on the following formula:
  *         - PLL output frequency = (((HSI frequency / PLLB) * PLL1A) / PLL1C)
  *         - PLLB: ensure that the VCO input frequency ranges from @ref RCM_PLLVCO_INPUT_MIN to @ref RCM_PLLVCO_INPUT_MAX (PLLVCO_input = HSI frequency / PLLB)
  *         - PLL1A: ensure that the VCO output frequency is between @ref RCM_PLLVCO_OUTPUT_MIN and @ref RCM_PLLVCO_OUTPUT_MAX (PLLVCO_output = PLLVCO_input * PLL1A)
  *         - PLL1C: ensure that max frequency at 180000000 Hz is reach (PLLVCO_output / PLL1C)
  * @note   Function is based on the following formula(Only for APM32F402/403xx device):
  *         - PLL output frequency = ((HSE frequency / PREDIV) * PLLMULCFG)
  *         - PLLHSEPSC: Set to 2 for few devices
  *         - PLLMULCFG: The application software must set correctly the PLL multiplication factor to
  *                   not exceed @ref UTILS_PLL_OUTPUT_MAX
  * @param  HSEFrequency Value between Min_Data = UTILS_HSE_FREQUENCY_MIN and Max_Data = UTILS_HSE_FREQUENCY_MAX
  * @param  HSEBypass This parameter can be one of the following values:
  *         @arg @ref DDL_UTILS_HSEBYPASS_ON
  *         @arg @ref DDL_UTILS_HSEBYPASS_OFF
  * @param  UTILS_PLLInitStruct pointer to a @ref DDL_UTILS_PLLInitTypeDef structure that contains
  *                             the configuration information for the PLL.
  * @param  UTILS_ClkInitStruct pointer to a @ref DDL_UTILS_ClkInitTypeDef structure that contains
  *                             the configuration information for the BUS prescalers.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: Max frequency configuration done
  *          - ERROR: Max frequency configuration not done
  */
ErrorStatus DDL_PLL_ConfigSystemClock_HSE(uint32_t HSEFrequency, uint32_t HSEBypass,
                                         DDL_UTILS_PLLInitTypeDef *UTILS_PLLInitStruct, DDL_UTILS_ClkInitTypeDef *UTILS_ClkInitStruct)
{
  ErrorStatus status = SUCCESS;
  uint32_t pllfreq = 0U;

  /* Check the parameters */
  ASSERT_PARAM(IS_DDL_UTILS_HSE_FREQUENCY(HSEFrequency));
  ASSERT_PARAM(IS_DDL_UTILS_HSE_BYPASS(HSEBypass));
#if defined(APM32F403xx) || defined(APM32F402xx)
  ASSERT_PARAM(IS_DDL_UTILS_PREDIV_VALUE(UTILS_PLLInitStruct->Prediv));
#endif /* APM32F403xx || APM32F402xx */

  /* Check if one of the PLL is enabled */
  if(UTILS_PLL_IsBusy() == SUCCESS)
  {
    /* Calculate the new PLL output frequency */
    pllfreq = UTILS_GetPLLOutputFrequency(HSEFrequency, UTILS_PLLInitStruct);

    /* Enable HSE if not enabled */
    if(DDL_RCM_HSE_IsReady() != 1U)
    {
      /* Check if need to enable HSE bypass feature or not */
      if(HSEBypass == DDL_UTILS_HSEBYPASS_ON)
      {
        DDL_RCM_HSE_EnableBypass();
      }
      else
      {
        DDL_RCM_HSE_DisableBypass();
      }

      /* Enable HSE */
      DDL_RCM_HSE_Enable();
      while (DDL_RCM_HSE_IsReady() != 1U)
      {
        /* Wait for HSE ready */
      }
    }

    /* Configure PLL */
#if defined(APM32F403xx) || defined(APM32F402xx)
    DDL_RCM_PLL_ConfigDomain_SYS((DDL_RCM_PLLSOURCE_HSE | UTILS_PLLInitStruct->Prediv), UTILS_PLLInitStruct->PLLMul);
#else
    DDL_RCM_PLL_ConfigDomain_SYS(DDL_RCM_PLLSOURCE_HSE, UTILS_PLLInitStruct->PLLB, UTILS_PLLInitStruct->PLL1A,
                                UTILS_PLLInitStruct->PLL1C);
#endif /* APM32F403xx || APM32F402xx */

    /* Enable PLL and switch system clock to PLL */
    status = UTILS_EnablePLLAndSwitchSystem(pllfreq, UTILS_ClkInitStruct);
  }
  else
  {
    /* Current PLL configuration cannot be modified */
    status = ERROR;
  }

  return status;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup UTILS_DDL_Private_Functions
  * @{
  */
/**
  * @brief  Function to check that PLL can be modified
  * @param  PLL_InputFrequency  PLL input frequency (in Hz)
  * @param  UTILS_PLLInitStruct pointer to a @ref DDL_UTILS_PLLInitTypeDef structure that contains
  *                             the configuration information for the PLL.
  * @retval PLL output frequency (in Hz)
  */
static uint32_t UTILS_GetPLLOutputFrequency(uint32_t PLL_InputFrequency, DDL_UTILS_PLLInitTypeDef *UTILS_PLLInitStruct)
{
  uint32_t pllfreq = 0U;

  /* Check the parameters */
#if defined(APM32F403xx) || defined(APM32F402xx)
  ASSERT_PARAM(IS_DDL_UTILS_PLLMUL_VALUE(UTILS_PLLInitStruct->PLLMul));
#else
  ASSERT_PARAM(IS_DDL_UTILS_PLLB_VALUE(UTILS_PLLInitStruct->PLLB));
  ASSERT_PARAM(IS_DDL_UTILS_PLL1A_VALUE(UTILS_PLLInitStruct->PLL1A));
  ASSERT_PARAM(IS_DDL_UTILS_PLL1C_VALUE(UTILS_PLLInitStruct->PLL1C));
#endif /* APM32F403xx || APM32F402xx */
  
  #if defined(APM32F403xx) || defined(APM32F402xx)
  pllfreq = __DDL_RCM_CALC_PLLCLK_FREQ(PLL_InputFrequency / ((UTILS_PLLInitStruct->Prediv >> RCM_CFG_PLLHSEPSC_Pos) + 1U), UTILS_PLLInitStruct->PLLMul);
  #else
  /* Check different PLL parameters according to RM                          */
  /*  - PLLB: ensure that the VCO input frequency ranges from @ref UTILS_PLLVCO_INPUT_MIN to @ref UTILS_PLLVCO_INPUT_MAX MHz.   */
  pllfreq = PLL_InputFrequency / (UTILS_PLLInitStruct->PLLB & (RCM_PLL1CFG_PLLB >> RCM_PLL1CFG_PLLB_Pos));
  ASSERT_PARAM(IS_DDL_UTILS_PLLVCO_INPUT(pllfreq));

  /*  - PLL1A: ensure that the VCO output frequency is between @ref UTILS_PLLVCO_OUTPUT_MIN and @ref UTILS_PLLVCO_OUTPUT_MAX .*/
  pllfreq = pllfreq * (UTILS_PLLInitStruct->PLL1A & (RCM_PLL1CFG_PLL1A >> RCM_PLL1CFG_PLL1A_Pos));
  ASSERT_PARAM(IS_DDL_UTILS_PLLVCO_OUTPUT(pllfreq));
  
  /*  - PLL1C: ensure that max frequency at @ref RCM_MAX_FREQUENCY Hz is reached     */
  pllfreq = pllfreq / (((UTILS_PLLInitStruct->PLL1C >> RCM_PLL1CFG_PLL1C_Pos) + 1) * 2);
#endif /* APM32F403xx || APM32F402xx */
  ASSERT_PARAM(IS_DDL_UTILS_PLL_FREQUENCY(pllfreq));

